byAlex_regularPorousMedia-master/singlePhase/rhombohedron/src/firstDirection/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    skeletonWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftSide
    {
        type            fixedValue;
        value           uniform (1e-4 0 0);
    }
    rightSide
    {
        type            fixedValue;
        value           uniform (5e-5 0 0);
    }

    cyclicOppositeSide
    {
        type            cyclicAMI;
    }
    cyclicFrontSide
    {
        type            cyclicAMI;
    }

    cyclicTopSide
    {
        type            cyclicAMI;
    }
    cyclicBottomSide
    {
        type            cyclicAMI;
    }
}

// ************************************************************************* //
