byAlex_regularPorousMedia-master/singlePhase/rhombohedron/src/firstDirection/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                         steadyState;
}

gradSchemes
{
    default                         Gauss linear;
    grad(p)                         cellLimited Gauss linear 1;
    grad(U)                         cellLimited Gauss linear 1;
}

divSchemes
{
    default                         none;

    div(phi,U)                      bounded Gauss vanLeer;
    div(phi,k)                      bounded Gauss vanLeer;
    div(phi,epsilon)                bounded Gauss vanLeer;
    div(phi,R)                      bounded Gauss vanLeer;
    div(R)                          bounded Gauss vanLeer;
    div(phi,nuTilda)                bounded Gauss vanLeer;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default                         none;
    laplacian(1,Phi)                Gauss linear limited corrected 0.33;
    laplacian(nuEff,U)              Gauss linear limited corrected 0.33;
    laplacian(rAUf,p)               Gauss linear limited corrected 0.33;
    laplacian(DkEff,k)              Gauss linear limited corrected 0.33;
    laplacian(DepsilonEff,epsilon)  Gauss linear limited corrected 0.33;
    laplacian(DREff,R)              Gauss linear limited corrected 0.33;
    laplacian(DnuTildaEff,nuTilda)  Gauss linear limited corrected 0.33;
    laplacian((1|A(U)),p)           Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default                         linear;
    /*interpolate(U)                  linear;*/
}

snGradSchemes
{
    default                         limited corrected 0.33;
}

/*wallDist
{
    method meshWave;
}*/

// ************************************************************************* //
