byAlex_regularPorousMedia-master/singlePhase/rhombohedron/src/firstDirection/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Phi
    {
        solver                  GAMG;
        tolerance               1e-10;
        relTol                  0;

        smoother                DICGaussSeidel;

        cacheAgglomeration      true;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        mergeLevels             1;

        /*solver                  PCG;
        preconditioner          DIC;
        tolerance               1e-10;
        relTol                  1e-1;*/
    }

    p
    {
//         solver                  GAMG;
//         tolerance               1e-8;
//         relTol                  1e-3;
// 
//         smoother                DICGaussSeidel;
// 
//         cacheAgglomeration      true;
//         nCellsInCoarsestLevel   10;
//         agglomerator            faceAreaPair;
//         mergeLevels             1;

        solver                  PCG;
        preconditioner          DIC;
        tolerance               1e-8;
        relTol                  1e-3;
    }

    "(U|k|epsilon|omega)"
    {
        /*solver                  smoothSolver;
        smoother                symGaussSeidel;
        tolerance               1e-8;
        relTol                  1e-1;*/

        solver                  PBiCG;
        preconditioner          DILU;
        tolerance               1e-8;
        relTol                  1e-3;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors    4;
    pRefCell                    0;
    pRefValue                   0;

    residualControl
    {
        p                       1e-6;
        U                       1e-6;
    }
}

relaxationFactors
{
    fields
    {
        //SMESH
//         p                       0.3;
        //snappyHexMesh
        p                       0.3;
    }

    equations
    {
        //SMESH
//         "(U|k|epsilon|omega).*" 0.9;
        //snappyHexMesh
        "(U|k|epsilon|omega).*" 0.9;
        nuTilda                 1;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors    15;

    PhiRefCell                  0;
    PhiRefPoint                 0;
    PhiRefValue                 0;
    Phi                         0;
}

cache
{
    grad(U);
}

// ************************************************************************* //
