byAlex_regularPorousMedia-master/singlePhase/rhombohedron/src/firstDirection/system/snappyHexMeshSrc/STL_list
porousCell.stl
{
    type triSurfaceMesh;
    name porousCell;

    regions
    {
        skeletonWall
        {
            name skeletonWall;
        }

        leftSide
        {
            name leftSide;
        }

        rightSide
        {
            name rightSide;
        }

        frontSide
        {
            name frontSide;
        }

        oppositeSide
        {
            name oppositeSide;
        }        

        topSide
        {
            name topSide;
        }

        bottomSide
        {
            name bottomSide;
        }
    }
}

/*leftSide.stl        {type triSurfaceMesh;name leftSide;}
rightSide.stl       {type triSurfaceMesh;name rightSide;}
oppositeSide.stl    {type triSurfaceMesh;name oppositeSide;}
frontSide.stl       {type triSurfaceMesh;name frontSide;}
topSide.stl         {type triSurfaceMesh;name topSide;}
bottomSide.stl      {type triSurfaceMesh;name bottomSide;}*/
