byAlex_regularPorousMedia-master/singlePhase/rhombohedron/src/firstDirection/system/snappyHexMeshSrc/eMesh_list
{
    file "porousCell.eMesh";
    level 5;
}
