byAlex_regularPorousMedia-master/singlePhase/rhombohedron/src/firstDirection/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    AMI11;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "cyclicOppositeSide";
        }
    }
    {
        name    AMI12;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "cyclicFrontSide";
        }
    }
    {
        name    AMI21;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "cyclicTopSide";
        }
    }
    {
        name    AMI22;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "cyclicBottomSide";
        }
    }
);

// ************************************************************************* //
